#### Terragrunt Format and Style 🖌 `success`
#### Terragrunt Initialization ⚙️ `success`
#### Terragrunt Validation 🤖 `success`
#### Terragrunt Plan 📖 `success`

<details><summary>Show Plan</summary>

```

Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02435673a7c107541]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-04c07f3aff8931fb2]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0cd5d7fc6d90c79dc]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-04090da52764bbead]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-062b2df2e9b588c5d]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-04d4f71d769c561a8]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0dd442484044f2b46]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f00abc820a2e8e72]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f01e6633f6f28d71]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0d141377b6ef13ea6]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-04d0aed479e5b16ee]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-03441690c33f7943f]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0df51eac9f69eea52]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-00cac3b0494f9be53]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-097175d90410f6d1f]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0b316362abb6ccdc0]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0c955f44128b65265]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0e8c9030168732dbe]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0df51eac9f69eea521080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09c5807946a5258e7]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vpc.aws_route_table.public[0] has been changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0df51eac9f69eea52"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0dd442484044f2b46"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "demo-terragrunt-VPC-public"
        }
        # (5 unchanged attributes hidden)
    }
  # module.vpc.aws_default_route_table.default[0] has been changed
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-0cd5d7fc6d90c79dc"
      + propagating_vgws       = []
        tags                   = {
            "Name" = "demo-terragrunt-VPC-default"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.vpc.aws_default_network_acl.this[0] has been changed
  ~ resource "aws_default_network_acl" "this" {
        id                     = "acl-04090da52764bbead"
        tags                   = {
            "Name" = "demo-terragrunt-VPC-default"
        }
        # (6 unchanged attributes hidden)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + icmp_code       = 0
          + icmp_type       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      - egress {
          - action          = "allow" -> null
          - from_port       = 0 -> null
          - ipv6_cidr_block = "::/0" -> null
          - protocol        = "-1" -> null
          - rule_no         = 101 -> null
          - to_port         = 0 -> null
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + icmp_code  = 0
          + icmp_type  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
      - egress {
          - action     = "allow" -> null
          - cidr_block = "0.0.0.0/0" -> null
          - from_port  = 0 -> null
          - protocol   = "-1" -> null
          - rule_no    = 100 -> null
          - to_port    = 0 -> null
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + icmp_code       = 0
          + icmp_type       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      - ingress {
          - action          = "allow" -> null
          - from_port       = 0 -> null
          - ipv6_cidr_block = "::/0" -> null
          - protocol        = "-1" -> null
          - rule_no         = 101 -> null
          - to_port         = 0 -> null
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + icmp_code  = 0
          + icmp_type  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
      - ingress {
          - action     = "allow" -> null
          - cidr_block = "0.0.0.0/0" -> null
          - from_port  = 0 -> null
          - protocol   = "-1" -> null
          - rule_no    = 100 -> null
          - to_port    = 0 -> null
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "demo-terragrunt-VPC-eu-north-1a"
        }
      + tags_all             = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "demo-terragrunt"
          + "Environment"      = "Development"
          + "Name"             = "demo-terragrunt-VPC-eu-north-1a"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-0f00abc820a2e8e72"
      + tags                               = {
          + "Name" = "demo-terragrunt-VPC-eu-north-1a"
        }
      + tags_all                           = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "demo-terragrunt"
          + "Environment"      = "Development"
          + "Name"             = "demo-terragrunt-VPC-eu-north-1a"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-03441690c33f7943f"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
Acquiring state lock. This may take a few moments...
aws_security_group.sg: Refreshing state... [id=sg-0732fc3c41a6f9eec]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
Releasing state lock. This may take a few moments...
Acquiring state lock. This may take a few moments...
aws_instance.this[0]: Refreshing state... [id=i-0b25c4379fa21d37e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_instance.this[0] will be updated in-place
  ~ resource "aws_instance" "this" {
        id                                   = "i-0b25c4379fa21d37e"
      ~ instance_type                        = "t3.micro" -> "m5.xlarge"
        tags                                 = {
            "Name" = "demo-terragrunt-bastion-host"
        }
        # (29 unchanged attributes hidden)









        # (9 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

Results for commit: dacc359df400cdfa2560d994cf5196b460783fda

*Pusher: @naturkach, Action: `pull_request`, Working Directory: `dev`, Workflow: `Terragrunt CI/CD Pipeline`*